Revit 2027 API
BuiltInFailures.ConnectorFailures.ShapesNotMatch Property
 Shapes do not match. A connection could not be made.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ShapesNotMatch { get; }
Public Shared ReadOnly Property ShapesNotMatch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ShapesNotMatch {
	FailureDefinitionId^ get ();
}
static member ShapesNotMatch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace